package com.examclouds.iv_java_operations;

public class BooleanLogic {
    public static void main(String[] args) {
        /*
        & - логика И
        | - логика ИЛИ
        ^ - логика исключающее ИЛИ
        ! - логика НЕ
        || - укороченная логика ИЛИ
        && - укороченная логика И
        == - логика равенство
        != - логика неравенство
        &= - логика И с присваиванием
        |= логика ИЛИ с присваиванием
        ^= логика исключающее ИЛИ с присваиванием
         */
    }
}
