package com.examclouds.arrays_tasks;

public class OneDimensionalDoubleArray {
    public static void main(String[] args) {
        Double[] myArray = {6.55, 9.99, 123.44, 55.55};
        System.out.println(myArray[0]);
    }
}

/*
2. Одномерный массив типа double.
Создать массив типа double с размером 4.
Записать в него любые значения с помощью блока для инициализации.
Вывести на консоль значение первого элемента.
 */
