package com.examclouds_2024.vi_arrays.tasks;

public class Task2 {
    public static void main(String[] args) {
        double[] doubleArray = {123.456, 456.432, 876.34, 345.32};
        System.out.println(doubleArray[0]);
    }
}


/*
2. Одномерный массив типа double.
Создать массив типа double с размером 4.
Записать в него любые значения с помощью блока для инициализации.
Вывести на консоль значение первого элемента.
 */